{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Sales Inquiry_Medium",
    "1": "Technical Support_High",
    "2": "Meeting Request_Medium",
    "3": "Internal Update_Low",
    "4": "Technical Support_Medium",
    "5": "Meeting Request_High"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Internal Update_Low": 3,
    "Meeting Request_High": 5,
    "Meeting Request_Medium": 2,
    "Sales Inquiry_Medium": 0,
    "Technical Support_High": 1,
    "Technical Support_Medium": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "vocab_size": 30522
}
